Stefancharles/AirconditionProject/source/app/stm32App.c
/************************************************************************************
*
*
*
*
*
************************************************************************************/

//头文件
#include <math.h>
#include "stm32App.h"
#include "chinese_font.h"
#include "stm32f103_config.h"
#include "ledNixietube.h"
#include "lcd12864.h"
#include "pcf8563.h"
#include "pcf8591.h"
#include "74hc595.h"
#include "NTCthermistor.h"
#include "remote.h"
#include "WiFiToCloud.h"
#include "main.h"

#ifdef PT100
#include "pt100.h"
#endif /*PT100*/


//温控箱相关参数
#define MAX_TEMP (99)  //热敏电阻最大测温值
#define MIN_TEMP (0)//(-20) //热敏电阻最小测温值

#ifdef PT100

#define ERROR_MAX_TEMP2 60//温度2最大可测量温度（根据需要设置）
#define ERROR_MIN_TEMP2 0//温度2最小可测量温度（根据需要设置）

#endif /*PT100*/

#define MAX_CTRL_TEMP 30 //最大可控温度，兼报警温度值

#ifdef POTENTIOMETER

//电位器相关参数
#define VREF_3_3_V 3.28	//参考电压
#define MAX_VR 2.2 //最大电位器电压
#define RESOLUTION_RATIO 10	//分辨率
#define RESOLUTION_MIN_TEMP (MAX_CTRL_TEMP-(uint8_t)(((MAX_VR/VREF_3_3_V)*256)/RESOLUTION_RATIO)) //最低温度(30-(uint8_t)(((2.2/3.2)*256)/RESOLUTION_RATIO))

#endif /* POTENTIOMETER */



int8_t upTemp=28;//28;//温度上限值
int8_t downTemp=20;//20;//温度下限值
uint8_t work=0;//工作状态标志寄存器
uint8_t oldWork=0;//工作状态标志寄存器
uint8_t F_Error = 0; //系统错误标记，0-正常，非0-异常
uint8_t systemPowerOnOff=1;

uint8_t RTC_BCD_Buf[7];//RTC时钟缓存,BCD码格式
uint8_t RTC_Buf[7];//RTC时钟缓存，十六进制格式
uint8_t buf_led[8]={2,0,1,4,0,5,2,0};
int8_t temperature1;//存放温度1数值，由热敏电阻采集的温度，单位：℃

#ifdef PT100
int8_t temperature2;//存放温度2数值，由PT100采集的温度，单位：℃
#endif /*PT100*/

uint8_t secondTemp;	//缓存RTC的秒，特殊说明：编码格式--BCD码

uint8_t RTC_SecondOld;//缓存RTC的秒，以前的数据.
uint8_t RTC_Second;	//缓存RTC的秒，现在的数据.
uint8_t RTC_TestBuf[7];//RTC时钟缓存，特殊说明：编码格式--BCD码

uint8_t alarm=0;//告警标志，0-正常，1-报警

char RTC_TimeTemp[32];//RTC时钟缓存

uint16_t T_ALARM_MS_OLD = 0;

#define P_FAN		RYLAY1//控制风扇寄存器
#define P_LAMP		RYLAY2//控制加热灯寄存器
#define P_LAMP_STA	GPIO_ReadOutputDataBit(RYLAY2_PIN_PORT, RYLAY2_PIN)
#define	ON			1	//开启
#define	OFF			0	//关闭

/*******************************************************************
*函数：void simpleAppInit(void)
*功能：应用初始化
*输入：无
*输出：无
*特殊说明：无
*******************************************************************/
void simpleAppInit(void)
{
	uint8_t temp=0;
	
	set_led_dispbuf(buf_led,0,8); //设置数码管初始显示
	
	printf("空调控制系统-V03-180327\r\n");
	LCD_Init();//初始化显示屏
	LCD_Clr();
	
	IIC_Init();//IIC总线初始化
	IIC1_Init();//IIC1总线初始化
	keyInit();//按键初始化
	
	//继电器初始化
	STM32_GPIOx_Init(RYLAY1_Init);
	STM32_GPIOx_Init(RYLAY2_Init);	
	
	HC595_GpioInit();//初始化74HC5959驱动I/O口
	
	/****************************************************************************
	*系统初始化部分
	*****************************************************************************/
	P_FAN = OFF;//控制风扇寄存器
	P_LAMP = OFF;//控制加热灯寄存器
	
	temp=10;
	while(temp--)
	{
		if(PCF8563_Init() != 1)//初始化RTC
		delay_ms(10);//等待RTC初始化完毕
	}
	//LCD12864初始化显示内容
	LCD_Init();
	LCD_DispFullImg((uint8_t *)newLandEduLogo);	//显示新大陆logo
	LCD_WriteChineseString( 6, 16, (uint8_t *)KongTiaoKongZhiXiTong, 6);
	delay_ms(1000);
	LCD_Clr();//清屏	
	LCD_WriteChineseString( 2, 24, (uint8_t *)newLandEdu, 5);
	LCD_WriteEnglishString( 4, 20, (uint8_t *)"Newland Edu");
	delay_ms(1000);
	LCD_Clr();//清屏
	memset(buf_led,MAX_LEDCH,sizeof(buf_led));//设置数码管初始显示内容
	set_led_dispbuf(buf_led,0,8); //数码管显示初始化
	
	Remote_Init();//红外遥控接收模块初始化
	
#ifdef USE_IWDG
	IWDG_Init();
#endif

	//时间参数初始化
	T_X_MS = 0;
	T_Y_MS = 0;
	T_Z_MS = 0;
	T_NET_MS = 0;
}

/*******************************************************************
*函数：void simpleAppProcess(void)
*功能：应用进程
*输入：无
*输出：无
*特殊说明：无
*******************************************************************/
void simpleAppProcess(void)
{
	uint8_t temp=0;	
	uint8_t NoWiFiToCloud=0;//无云网络服务，0-有服务，1-无服务；
ConnectToCloud:
	NoWiFiToCloud=ConnectCloudProcess();
	while(1)
	{
#ifdef USE_IWDG	
		IWDG_ReloadCounter();//重载看门狗定时器
#endif /*USE_IWDG*/
		
		//网络服务
		if(CloudProcess(NoWiFiToCloud) != 0)
		{
			printf("重连云平台！\r\n");
			LCD_Clr();
			work=0;
			goto ConnectToCloud;//重连服务器
		}
		
#ifndef POTENTIOMETER	
		temp=IR_RemoteScan();
		if(temp)//扫描红外管
		{
			printf("红外遥控器键值码 = %d(十进制)\r\n",temp);
			HalBuzzerBlink (HAL_BUZZER_0, 1, 50, 100);
		}
		IR_HandleProcess(temp);
#endif /*POTENTIOMETER*/
		if(systemPowerOnOff != 1)
		{//关机状态
			continue;
		}

		if(T_X_MS >= 166) //500MS
		{
			LCD_DisplayProcess();//LCD显示进程
			T_X_MS = 0;
		}
		if(T_Y_MS >= 33) //100MS
		{
			NTC_temperatureProcess();//采集温度进程
			if(work==0)
			{
				Air_conditionProcess();//温度调节控制进程
			}
			else
			{
				LCD_ClrDispAirConRun();
			}
			T_Y_MS = 0;
		}
		if(T_Z_MS>=2)
		{
#ifndef POTENTIOMETER
			KEY_HandleProcess();//按键事件处理进程
#endif /*POTENTIOMETER*/
			T_Z_MS=0;	
		}
#if EN_USART1_RX	//以下串口1预留功能代码
		if(F_USART1_RX_RECEIVING)
		{
			USART1_RX_BUF[USART1_RX_COUNT]='\0';
			USART1_SendStr(USART1_RX_BUF);
			F_USART1_RX_RECEIVING=0;
			USART1_RX_COUNT=0;
		}
#endif
		if(work==0)
		{
			AlarmProcess(alarm);//告警进程
		}
	}
}

/*******************************************************************
*函数：uint8_t ConnectCloudProcess(void)
*		连接云平台进程
*功能：和云平台建立有效连接
*输入：无
*输出：返回连接结果，0-有服务，1-无服务；
*特殊说明：无
*******************************************************************/
uint8_t ConnectCloudProcess(void)
{
	uint8_t TryCount=0;
	int8_t temp=0;	
	uint8_t NoWiFiToCloud=0;//无云网络服务，0-有服务，1-无服务；
	
	//初始化显示内容
	LCD_WriteEnglishString(0,0,(unsigned char *)"Connect To");
	LCD_WriteEnglishString(2,0,(unsigned char *)"Server ...");
	delay_ms(2000);//延时1000Ms待系统WiFi通讯模块启动完毕
	LCD_WriteEnglishString(2,0,(unsigned char *)"Server ......");
	printf("连接云平台...\r\n");
	//连接服务器
	for(TryCount=0; TryCount<3; TryCount++)
	{
		temp=ConnectToServer((char *)MY_DEVICE_ID, (char *)MY_SECRET_KEY);
		if(temp != 0)
		{
			NoWiFiToCloud=1;
			printf("Connect To Server ERROR=%d\r\n",temp);
		}
		else
		{
			NoWiFiToCloud=0;
			printf("Connect To Server Success !\r\n");
			break;
		}
	}
	ClrAtRxBuf();//清空AT缓存
	LCD_Clr();
	return NoWiFiToCloud;
}

/*******************************************************************
*函数：uint8_t CloudProcess(uint8_t NoWiFiToCloud)
*		云服务进程
*功能：和云平台的通信进程，对接收到到云平台数据进行解析，反馈云平台请求，
*	  并执行相应的指令。每隔3s发送相关数据到云平台。
*输入：uint8_t NoWiFiToCloud，系统联网情况，0-有联网，1-未联网
*输出：返回联网情况，有联网-0，无联网-1
*特殊说明：无
*******************************************************************/
uint8_t CloudProcess(uint8_t NoWiFiToCloud)
{
	uint8_t IpData[128];
	
	int8_t error=0;
	char RTC_TimeTemp[32];
	static int8_t erroCount=0;
	static uint8_t ReConnectCloudTimeCount=0;//重连服务器计时
	/***********************网络通信进程处理*************************/
	if(F_AT_RX_FINISH)//串口4接收到数据
	{// 接收到数据包
		ESP8266_GetIpData((uint8_t *)AT_RX_BUF, (char *)IpData);
		USER_DataAnalysisProcess((char *)IpData);
		memset(IpData, 0x00, 128);
		ClrAtRxBuf();
	}
	if(T_NET_MS >= 1000)//3S发送一次数据
	{
		T_NET_MS=0;
		//获取时间，并将日期、时间的BCD码转换为日期格式yyyy-mm-dd hh:mm:ss的字符串形式
		//RTC_GetTimeStr((char *)RTC_TimeTemp);//RTC_BCD_Buf
		sprintf(RTC_TimeTemp,"%d%d%d%d-%d%d-%d%d ",
							RTC_BCD_Buf[0]>>4,RTC_BCD_Buf[0]&0x0F,RTC_BCD_Buf[1]>>4,RTC_BCD_Buf[1]&0x0F,
							RTC_BCD_Buf[2]>>4,RTC_BCD_Buf[2]&0x0F,RTC_BCD_Buf[3]>>4,RTC_BCD_Buf[3]&0x0F);
		sprintf(&RTC_TimeTemp[11],"%d%d:%d%d:%d%d",
							RTC_BCD_Buf[4]>>4,RTC_BCD_Buf[4]&0x0F,RTC_BCD_Buf[5]>>4,RTC_BCD_Buf[5]&0x0F,
							RTC_BCD_Buf[6]>>4,RTC_BCD_Buf[6]&0x0F);
		//printf("当前%s\r\n",RTC_TimeTemp);
		error=SE_SendSensor3((char *)"upperLimit", upTemp, 
							 (char *)"lowerLimit", downTemp, 
							 (char *)"currentTemp", (uint8_t)temperature1, (char *)RTC_TimeTemp);
		ClrAtRxBuf();
		error=SE_SendSensor2((char *)"alarm", alarm, 
							 (char *)"power", systemPowerOnOff,(char *)RTC_TimeTemp);
		printf("alarm=%d\r\n",alarm);
		ClrAtRxBuf();
		printf("SE_SendSensor3 Error No. %d\r\n",error);
		//判断是否和服务器失去连接累计
		if(error != 0)
		{
			erroCount++;
		}
		else
		{
			erroCount=0;
		}
		if(erroCount > 6)//通讯失败次数超过6次视为设备离线
		{
			erroCount=0;
			if(NoWiFiToCloud != 1)//之前有连接成功服务器
			{
				return 1;//重新连接服务器
			}
		}
		if(NoWiFiToCloud)
		{//断网情况下
			ReConnectCloudTimeCount++;
			if(ReConnectCloudTimeCount>40)//每隔120s重新连接一次服务器。
			{
				ReConnectCloudTimeCount=0;
				return 1;//重新连接服务器
			}
		}
	}
	return 0;//网络连接正常
}

/*************************************************************************************************
*函数：POTENTIOMETER_Control(uint8_t* upValue, uint8_t* downValue, uint8_t upCh, uint8_t downCh)
*功能：根据对应的ADC通道，采集到的电位器的电压信号数字量大小，来确定上下限温度值
*输入：
*	uint8_t* upValue, 指向上限值寄存器地址
*	uint8_t* downValue, 指向下限值寄存器地址
*	uint8_t upCh, 设置上限值的ADC通道
*	uint8_t downCh, 设置下限值得ADC通道
*输出：无
*特别说明：硬件中电位器电压信号范围0~1.6V，温度控制范围18~30设施度度，具体和硬件电路的电压信号大小相关。
*************************************************************************************************/
#ifdef POTENTIOMETER
void POTENTIOMETER_Control(int8_t *upValue, int8_t *downValue, uint8_t upCh, uint8_t downCh)
{
	uint8_t upADC,downADC;
	
	PCF8591_ReadChannel(&upADC, upCh);//读取上限通道的ADC
	PCF8591_ReadChannel(&downADC, downCh);//读取下限通道的ADC
	*upValue = (upADC/RESOLUTION_RATIO) + RESOLUTION_MIN_TEMP;
	*downValue = (downADC/RESOLUTION_RATIO) + RESOLUTION_MIN_TEMP;
}
#endif /*POTENTIOMETER*/

/*******************************************************************
*函数：void ERROR_Message(uint8_t erro)
*功能：错误信息显示处理
*输入：uint8_t erro,错误值信息，取值1或2,1是阀值冲突，2是格式错误
*输出：无
*特殊说明：无
*******************************************************************/
void ERROR_Message(uint8_t erro)
{
	uint8_t count;
	if(erro != 0)
	{//系统错误处理
		if(erro == 1)
		{
			LCD_Clr();//清屏
			LCD_WriteEnglishString( 2, 0,(uint8_t *)"Threshold conflict, Please reset!");	
		}
		else if(erro == 2)
		{
			LCD_Clr();//清屏
			LCD_WriteEnglishString( 2, 0,(uint8_t *)"Time format error, Please reset!");
		}
		count=200;
		while(count--)
		{
			delay_ms(10);
#ifdef USE_IWDG	
			IWDG_ReloadCounter();//重载看门狗定时器
#endif /*USE_IWDG*/
		}
		LCD_Clr();//清屏
		LCD_WriteChineseString( 0, 0, (uint8_t *)shangXianZhi, 4);//显示上限值：
		LCD_WriteChineseString( 2, 0, (uint8_t *)xiaXianZhi, 4);//显示下限值：
		LCD_WriteChinese( 0, 80, (uint8_t *)spch_sheShiDu);//显示"℃"
		LCD_WriteChinese( 2, 80, (uint8_t *)spch_sheShiDu);
	}	
}

/*******************************************************************
*函数：void WORKSTATION_Message(uint8_t workTemp, 
*							int8_t upTempReg, 
*							int8_t downTempReg, 
*							int8_t temperature1Temp,
*							int8_t temperature2Temp)
*功能：系统工作信息显示，用于处理显示界面的显示内容处理
*输入：uint8_t workTemp,系统工作状态
*	int8_t upTempReg, 温度警戒上限
*	int8_t downTempReg, 温度警戒下限
*	int8_t temperature1Temp, 温度1-NTC
*	int8_t temperature2Temp,温度2-PT100
*输出：无
*特殊说明：无
*******************************************************************/
#ifdef PT100
void WORKSTATION_Message(uint8_t workTemp, 
							int8_t upTempReg, 
							int8_t downTempReg, 
							int8_t temperature1Temp,
							int8_t temperature2Temp)
#else
void WORKSTATION_Message(uint8_t workTemp, 
							int8_t upTempReg, 
							int8_t downTempReg, 
							int8_t temperature1Temp)
#endif /*PT100*/
{
	switch(workTemp)
	{
		case(0):
				LCD_WriteChineseString( 0, 0, (uint8_t *)shangXianZhi, 4);//显示上限值：
				LCD_WriteChineseString( 2, 0, (uint8_t *)xiaXianZhi, 4);//显示下限值：
				LCD_WriteChineseString( 4, 0, (uint8_t *)WenDu, 2);//显示温度1
#ifndef PT100
				LCD_WriteEnglish( 4, 32, '1');
				LCD_WriteEnglish( 4, 32, ':');
#else
				LCD_WriteEnglish( 4, 32, '1');
				LCD_WriteEnglish( 4, 40, ':');
		
				LCD_WriteChineseString( 6, 0, (uint8_t *)WenDu, 2);//显示温度2
				LCD_WriteEnglish( 6, 32, '2');
				LCD_WriteEnglish( 6, 40, ':');
				LCD_WriteChinese( 6, 72, (uint8_t *)spch_sheShiDu);//显示"℃"
#endif /*PT100*/
				LCD_WriteChinese( 0, 80, (uint8_t *)spch_sheShiDu);//显示"℃"
				LCD_WriteChinese( 2, 80, (uint8_t *)spch_sheShiDu);
				LCD_WriteChinese( 4, 72, (uint8_t *)spch_sheShiDu);
				
				
