Stefancharles/AirconditionProject/source/app/stm32App.c
				LCD_WriteEnglish(4,56,((uint8_t)fabs((float)temperature1Temp))/10+'0');//显示箱内温度1
				LCD_WriteEnglish(4,64,((uint8_t)fabs((float)temperature1Temp))%10+'0');
				if(temperature1Temp >= 0)
				{//正数
					LCD_WriteEnglish(4,48,' ');
				}
				else
				{//负数
					LCD_WriteEnglish(4,48,'-');
				}
#ifdef PT100
				if((temperature2Temp < ERROR_MAX_TEMP2) && (temperature2Temp > ERROR_MIN_TEMP2))
				{//正常温度以内的数值
					LCD_WriteEnglish(6,56,((uint8_t)fabs((float)temperature2Temp))/10+'0');//显示箱内温度2
					LCD_WriteEnglish(6,64,((uint8_t)fabs((float)temperature2Temp))%10+'0');
					if(temperature2Temp >= 0)
					{//正数
						LCD_WriteEnglish(6,48,' ');
					}
					else
					{//负数
						LCD_WriteEnglish(6,48,'-');
					}
				}
				else
				{//超出正常温度
					LCD_WriteEnglish(6,56,'-');//显示箱内温度2
					LCD_WriteEnglish(6,64,'-');
					LCD_WriteEnglish(6,48,'-');
				}
#endif /*PT100*/
			break;//数码管第五位不显示,LCD显示"智能温控箱"
		case(1):
				LCD_WriteEnglishString( 4, 0, (uint8_t *)"               ");
				LCD_WriteEnglishString( 6, 0, (uint8_t *)"               ");
				LCD_WriteChineseString( 6, 24, (uint8_t *)sheZhiShangXianZhi, 5);
			break;//LCD显示"设置上限值"
		case(2):
				LCD_WriteEnglishString( 4, 0, (uint8_t *)"               ");
				LCD_WriteEnglishString( 6, 0, (uint8_t *)"               ");
				LCD_WriteChineseString( 6, 24, (uint8_t *)sheZhiXiaXianZhi, 5);
			break;//LCD显示"设置下限值"
		case(3):
				LCD_WriteEnglishString( 4, 0, (uint8_t *)"               ");
				LCD_WriteEnglishString( 6, 0, (uint8_t *)"               ");
				LCD_WriteChineseString( 6, 24, (uint8_t *)sheZhi, 2);
				LCD_WriteChineseString( 6, 24+32, (uint8_t *)RTC_Nian, 1);
			break;//LCD显示"设置年"
		case(4):
				LCD_WriteEnglishString( 4, 0, (uint8_t *)"               ");
				LCD_WriteEnglishString( 6, 0, (uint8_t *)"               ");
				LCD_WriteChineseString( 6, 24, (uint8_t *)sheZhi, 2);
				LCD_WriteChineseString( 6, 24+32, (uint8_t *)RTC_Yue, 1);
			break;//LCD显示"设置月"
		case(5):
				LCD_WriteEnglishString( 4, 0, (uint8_t *)"               ");
				LCD_WriteEnglishString( 6, 0, (uint8_t *)"               ");
				LCD_WriteChineseString( 6, 24, (uint8_t *)sheZhi, 2);
				LCD_WriteChineseString( 6, 24+32, (uint8_t *)RTC_Ri, 1);
			break;//LCD显示"设置日"
		case(6):
				LCD_WriteEnglishString( 4, 0, (uint8_t *)"               ");
				LCD_WriteEnglishString( 6, 0, (uint8_t *)"               ");
				LCD_WriteChineseString( 6, 24, (uint8_t *)sheZhi, 2);
				LCD_WriteChineseString( 6, 24+32, (uint8_t *)RTC_Shi, 1);
			break;//LCD显示"设置时"
		case(7):
				LCD_WriteEnglishString( 4, 0, (uint8_t *)"               ");
				LCD_WriteEnglishString( 6, 0, (uint8_t *)"               ");
				LCD_WriteChineseString( 6, 24, (uint8_t *)sheZhi, 2);
				LCD_WriteChineseString( 6, 24+32, (uint8_t *)RTC_Fen, 1);
			break;//LCD显示"设置分"
		case(8):
				LCD_WriteEnglishString( 4, 0, (uint8_t *)"               ");
				LCD_WriteEnglishString( 6, 0, (uint8_t *)"               ");
				LCD_WriteChineseString( 6, 24, (uint8_t *)sheZhi, 2);
				LCD_WriteChineseString( 6, 24+32, (uint8_t *)RTC_Miao, 1);
			break;//LCD显示"设置秒"
		default:
				LCD_Clr();//清屏
			break;//默认状态
	}
	LCD_WriteEnglish(0,64,((uint8_t)fabs((float)upTempReg))/10+'0');//显示上限值数值
	LCD_WriteEnglish(0,72,((uint8_t)fabs((float)upTempReg))%10+'0');
	if(upTempReg >= 0)
	{
		LCD_WriteEnglish(0,56,' ');
	}
	else
	{
		LCD_WriteEnglish(0,56,'-');
	}
	LCD_WriteEnglish(2,64,((uint8_t)fabs((float)downTempReg))/10+'0');//显示下限值数值
	LCD_WriteEnglish(2,72,((uint8_t)fabs((float)downTempReg))%10+'0');
	if(downTempReg >= 0)
	{
		LCD_WriteEnglish(2,56,' ');
	}
	else
	{
		LCD_WriteEnglish(2,56,'-');
	}
}

/*******************************************************************
*函数：void LED_TubeMessage(uint8_t workTemp, uint8_t *dataBuf)
*功能：LED数码管信息显示处理，LED数码管信息显示处理，根据系统工作状态处
*		理数码管的显示内容；
*输入：uint8_t workTemp-系统工作状态， 
*			uint8_t *dataBuf-RTC数据，年月日时分秒
*输出：无
*特殊说明：无
*******************************************************************/
void LED_TubeMessage(uint8_t workTemp, uint8_t *dataBuf)
{
	switch(work)
	{
		case(0):
		case(1):
		case(2):
				if(Time_CheckValidity((uint8_t *)dataBuf) != 0)//判断RTC时钟格式是否有误
				{//RTC格式正确
					buf_led[0]=(dataBuf[2]>>4)&0x0F;//月
					buf_led[1]=dataBuf[2]&0x0F;
					buf_led[2]=(dataBuf[3]>>4)&0x0F;//日
					buf_led[3]=dataBuf[3]&0x0F;
					buf_led[4]=(dataBuf[4]>>4)&0x0F;//时
					buf_led[5]=dataBuf[4]&0x0F;
					buf_led[6]=(dataBuf[5]>>4)&0x0F;//分
					buf_led[7]=dataBuf[5]&0x0F;
					if(secondTemp != dataBuf[6])//秒
					{
						secondTemp = dataBuf[6];
						buf_led[5]=((~buf_led[5])&0x80)|buf_led[5];
					}
					set_led_dispbuf(buf_led,0,8);
				}
				else
				{//RTC格式不正确
					buf_led[0]=24;/*r 24*/
					buf_led[1]=25;/*t 25*/
					buf_led[2]=12;/*c 12*/
					buf_led[3]=14;/*E 14*/
					buf_led[4]=24;/*r 24*/
					buf_led[5]=24;/*r 24*/
					buf_led[6]=21;/*o 21*/
					buf_led[7]=24;/*r 24*/
					set_led_dispbuf(buf_led,0,8);
				}
			break;
		case(3)://设置年份
				buf_led[0]=(RTC_Buf[0]/10)&0x0F;
				buf_led[1]=(RTC_Buf[0]%10)&0x0F;;
				buf_led[2]=(RTC_Buf[1]/10)&0x0F;
				buf_led[3]=(RTC_Buf[1]%10)&0x0F;;
				buf_led[4]=(RTC_Buf[2]/10)&0x0F;
				buf_led[5]=(RTC_Buf[2]%10)&0x0F;;
				buf_led[6]=(RTC_Buf[3]/10)&0x0F;
				buf_led[7]=(RTC_Buf[3]%10)&0x0F;;
				if(secondTemp != dataBuf[6])//被设置位闪烁
				{
					secondTemp = dataBuf[6];
					buf_led[2]=29;/*空格 29*/
					buf_led[3]=29;/*空格 29*/
				}
				set_led_dispbuf(buf_led,0,8);
			break;
		case(4)://设置月
				buf_led[0]=(RTC_Buf[0]/10)&0x0F;
				buf_led[1]=(RTC_Buf[0]%10)&0x0F;;
				buf_led[2]=(RTC_Buf[1]/10)&0x0F;
				buf_led[3]=(RTC_Buf[1]%10)&0x0F;;
				buf_led[4]=(RTC_Buf[2]/10)&0x0F;
				buf_led[5]=(RTC_Buf[2]%10)&0x0F;;
				buf_led[6]=(RTC_Buf[3]/10)&0x0F;
				buf_led[7]=(RTC_Buf[3]%10)&0x0F;;
				if(secondTemp != dataBuf[6])
				{//被设置位闪烁
					secondTemp = dataBuf[6];
					buf_led[4]=29;/*空格 29*/
					buf_led[5]=29;/*空格 29*/
				}
				set_led_dispbuf(buf_led,0,8);
			break;
		case(5)://设置日
				buf_led[0]=(RTC_Buf[0]/10)&0x0F;
				buf_led[1]=(RTC_Buf[0]%10)&0x0F;;
				buf_led[2]=(RTC_Buf[1]/10)&0x0F;
				buf_led[3]=(RTC_Buf[1]%10)&0x0F;;
				buf_led[4]=(RTC_Buf[2]/10)&0x0F;
				buf_led[5]=(RTC_Buf[2]%10)&0x0F;;
				buf_led[6]=(RTC_Buf[3]/10)&0x0F;
				buf_led[7]=(RTC_Buf[3]%10)&0x0F;;
				if(secondTemp != dataBuf[6])
				{//被设置位闪烁
					secondTemp = dataBuf[6];
					buf_led[6]=29;/*空格 29*/
					buf_led[7]=29;/*空格 29*/
				}
				set_led_dispbuf(buf_led,0,8);
			break;
		case(6)://设置时
				buf_led[0]=29;/*空格 29*/
				buf_led[1]=(RTC_Buf[4]/10)&0x0F;
				buf_led[2]=(RTC_Buf[4]%10)&0x0F;;
				buf_led[3]=(RTC_Buf[5]/10)&0x0F;
				buf_led[4]=(RTC_Buf[5]%10)&0x0F;;
				buf_led[5]=(RTC_Buf[6]/10)&0x0F;
				buf_led[6]=(RTC_Buf[6]%10)&0x0F;;
				buf_led[7]=29;/*空格 29*/
				if(secondTemp != dataBuf[6])
				{//被设置位闪烁
					secondTemp = dataBuf[6];
					buf_led[1]=29;/*空格 29*/
					buf_led[2]=29;/*空格 29*/
				}
				set_led_dispbuf(buf_led,0,8);
			break;
		case(7)://设置分
				buf_led[0]=29;/*空格 29*/
				buf_led[1]=(RTC_Buf[4]/10)&0x0F;
				buf_led[2]=(RTC_Buf[4]%10)&0x0F;;
				buf_led[3]=(RTC_Buf[5]/10)&0x0F;
				buf_led[4]=(RTC_Buf[5]%10)&0x0F;;
				buf_led[5]=(RTC_Buf[6]/10)&0x0F;
				buf_led[6]=(RTC_Buf[6]%10)&0x0F;;
				buf_led[7]=29;/*空格 29*/
				if(secondTemp != dataBuf[6])
				{//被设置位闪烁
					secondTemp = dataBuf[6];
					buf_led[3]=29;/*空格 29*/
					buf_led[4]=29;/*空格 29*/
				}
				set_led_dispbuf(buf_led,0,8);
			break;
		case(8)://设置秒
				buf_led[0]=29;/*空格 29*/
				buf_led[1]=(RTC_Buf[4]/10)&0x0F;
				buf_led[2]=(RTC_Buf[4]%10)&0x0F;;
				buf_led[3]=(RTC_Buf[5]/10)&0x0F;
				buf_led[4]=(RTC_Buf[5]%10)&0x0F;;
				buf_led[5]=(RTC_Buf[6]/10)&0x0F;
				buf_led[6]=(RTC_Buf[6]%10)&0x0F;;
				buf_led[7]=29;/*空格 29*/
				if(secondTemp != dataBuf[6])
				{//被设置位闪烁
					secondTemp = dataBuf[6];
					buf_led[5]=29;/*空格 29*/
					buf_led[6]=29;/*空格 29*/
				}
				set_led_dispbuf(buf_led,0,8);
			break;
		default: 
				buf_led[0]=14;/*E 14*/
				buf_led[1]=24;/*r 24*/
				buf_led[2]=24;/*r 24*/
				buf_led[3]=21;/*o 21*/
				buf_led[4]=24;/*r 24*/
				buf_led[5]=29;/*空格 29*/
				buf_led[6]=29;/*空格 29*/
				buf_led[7]=29;/*空格 29*/
				set_led_dispbuf(buf_led,0,8);
			break;
	}
}

/*******************************************************************
*函数：void LCD_DisplayProcess(void)
*功能：LCD显示进程
*输入：无
*输出：无
*特殊说明：无
*******************************************************************/
void LCD_DisplayProcess(void)
{
	if(F_Error != 0)
	{//系统错误处理
		ERROR_Message(F_Error);
		F_Error = 0;
	}
#ifdef PT100
	WORKSTATION_Message(work, upTemp, downTemp, temperature1, temperature2);
#else
	WORKSTATION_Message(work, upTemp, downTemp, temperature1);
#endif /*PT100*/
	PCF8563_GetTime((uint8_t *)RTC_BCD_Buf);//读取RTC时钟
	LED_TubeMessage(work, RTC_BCD_Buf);
}

/*******************************************************************
*函数：void LCD_ClrDispAirConRun(void)
*功能：清空LCD显示空调运行状态提示信息
*输入：无
*输出：无
*特殊说明：无
*******************************************************************/
void LCD_ClrDispAirConRun(void)
{
	P_LAMP=OFF;//关灯
	P_FAN=OFF;//关扇散热
	LCD_WriteEnglishString( 0, 96, (uint8_t *)"    ");
	LCD_WriteEnglishString( 2, 96, (uint8_t *)"    ");
	LCD_WriteEnglishString( 4, 96, (uint8_t *)"    ");
	//LCD_WriteEnglishString( 6, 96, (uint8_t *)"    ");
}

/*******************************************************************
*函数：void NTC_temperatureProcess(void)
*功能：采集温度部分进程
*输入：无
*输出：无
*特殊说明：无
*******************************************************************/
void NTC_temperatureProcess(void)
{
		temperature1 = getTemperature(0);//采集ADC0通道的热敏电阻温度
		if(temperature1 > MAX_TEMP || temperature1 <= MIN_TEMP)	 //PCF8591通信异常
		{
			;
//			printf("读取ADC1失败 或 超出温度测量范围！\r\n");
//			printf("Read ADC1 Error !\r\n");
		}
#ifdef PT100
		temperature2 = getPt100Temperature(1);//采集ADC0通道的Pt100温度
		if(temperature2 > ERROR_MAX_TEMP2 || temperature2 <= ERROR_MIN_TEMP2)	 //PCF8591通信异常
		{
			;
//			printf("读取ADC2失败 或 超出温度测量范围！\r\n");
//			printf("Read ADC2 Error !\r\n");
		}
#endif /*PT100*/
		
/****************************************************************************
*电位器调整上下限温度部分
*****************************************************************************/
#ifdef POTENTIOMETER
		POTENTIOMETER_Control(&upTemp, &downTemp, 2, 3);
#endif /*POTENTIOMETER*/
}

/*******************************************************************
*函数：void Air_conditionProcess(void)
*功能：温度控制进程
*输入：无
*输出：无
*特殊说明：无
*******************************************************************/
void Air_conditionProcess(void)
{
	//根据上、下限温度值，自动控制箱内温度
	/*
	P33口用于控制风扇转动或停止,P34口用于控制加热灯的打开或关闭。

	1. 
	函数“void PCF8563_GetTime(uint8_t *ptr);”用于获取RTC时钟。
	获取到的时钟信息“ptr”的数据格式如下：（注意：数据格式是BCD码格式）
	*-|----|-------------|------|------|------|------|------|-
	* |数组|ptr[0]~ptr[1]|ptr[2]|ptr[3]|ptr[4]|ptr[5]|ptr[6]|
	*-|----|-------------|------|------|------|------|------|-
	* |解释|年         	 |月    | 日   |时    |分    |秒    |
	*-|----|-------------|------|------|------|------|------|-
	* |示例|0x2017       |0x12  |0x25  |0x12  |0x34  |0x56  |
	*-|----|-------------|------|------|------|------|------|-
	* |时钟|2017年       |12月  |25日  |12时  |34分  |56秒  |
	*-|----|-------------|------|------|------|------|------|-

	2. 
	函数“Convert_BcdToHex(uint8_t *bcd, uint8_t *hex)”用于将数组bcd[]内的BCD码转换成常用的十六进制，并存到数组hex[]中。
	比如bcd[]={0x20,0x17}，经过函数Convert_BcdToHex()处理后，转换结果为hex[]={0x14,0x11}。

	特别说明：函数PCF8563_GetTime()、Convert_BcdToHex()在“hal_pcf8563.c”中定义，本文件默认已经包含头文件“hal_pcf8563.h”。

