Stefancharles/AirconditionProject/source/app/stm32App.c
	3. 
	“int8_t temperature1;//存放温度1数值，由热敏电阻采集的温度，单位：℃”，temperature1是有符号整型数据。
	“uint8_t RTC_SecondOld;//缓存RTC的秒，以前的数据.”，RTC_SecondOld是无符号整型数据。
	“uint8_t RTC_Second;	//缓存RTC的秒，现在的数据.”，RTC_Second是无符号整型数据。
	“uint8_t RTC_TestBuf[7];//RTC时钟缓存，特殊说明：编码格式--BCD码”，数组RTC_TestBuf[]是无符号整型数据。
	上述变量已经在main()函数起始处定义，这里可以直接使用。老师们也可以根据自己的需要定义变量。

	*/

	 //系统控制加热灯和风扇转动来，从而调节温控箱内温度。这部分的功能代码由竞赛者补充填写到下方空白区域
		
		/*-----------空白部分起始线-----------*/
		
		//参考代码如下：
		PCF8563_GetTime((uint8_t *)RTC_TestBuf);
		Convert_BcdToHex(&RTC_TestBuf[6], &RTC_Second); //获取RTC秒钟数值
		
		if(temperature1 >= MAX_CTRL_TEMP)
		{//超出系统控制能力，亮灯1S，关灯2S表示警告
			alarm=1;
//			P_FAN = ON;//温度过高，开风扇散热
			//printf("温度失控警告 & temperature1 >= MAX_CTRL_TEMP\r\n");
			/*if(P_LAMP_STA != ON)
			{
				if((RTC_Second-RTC_SecondOld) >= 2)//关灯2秒
				{
					P_LAMP = ON;//开灯
					RTC_SecondOld = RTC_Second;//保存当前时间以供下次参考
					printf("温度失控警告！！\r\n");
				}
			}
			else
			{
				if((RTC_Second-RTC_SecondOld) >= 1)//开灯1秒
				{
					P_LAMP = OFF;//关灯
					RTC_SecondOld = RTC_Second;//保存当前时间以供下次参考
					HalBuzzerBlink (HAL_BUZZER_0, 2, 50, 200);//蜂鸣器警告
					printf("温度失控警告！\r\n");
				}
			}*/
			//LCD_WriteChineseString( 2, 96, (uint8_t *)IND_ShiKong, 2);
			LCD_WriteChineseString( 4, 96, (uint8_t *)IND_JingGao, 2);
			if(temperature1>upTemp)
			{//温度过高，开风扇散热
				P_FAN=ON;
			}
			else
			{//关风扇
				P_FAN=OFF;
			}
			/*if(temperature1<downTemp)
			{//温度过低，开灯加热
				P_LAMP=ON;
			}
			else
			{//关灯
				P_LAMP=OFF;
			}*/
			//显示提示
			if(temperature1<downTemp)
			{//温度过低，开灯加热
				LCD_WriteChineseString( 2, 96, (uint8_t *)IND_JiaRe, 2);
			}
			else if(temperature1>upTemp)
			{//温度过高，开风扇散热
				LCD_WriteChineseString( 2, 96, (uint8_t *)IND_ZhiLeng, 2);
			}
			else
			{
				LCD_WriteEnglishString( 2, 96, (uint8_t *)"    ");
			}
		}
		else
		{//正常控制
			alarm=0;
			RTC_SecondOld = RTC_Second;//保存当前时间以供下次参考
			if(upTemp >= downTemp)
			{
				if(temperature1<downTemp)
				{//温度过低，开灯加热
					P_LAMP=ON;
				}
				else
				{//关灯
					P_LAMP=OFF;
				}
				if(temperature1>upTemp)
				{//温度过高，开风扇散热
					P_FAN=ON;
				}
				else
				{//关风扇
					P_FAN=OFF;
				}
				//显示提示
				if(temperature1<downTemp)
				{//温度过低，开灯加热
					LCD_WriteChineseString( 2, 96, (uint8_t *)IND_JiaRe, 2);
				}
				else if(temperature1>upTemp)
				{//温度过高，开风扇散热
					LCD_WriteChineseString( 2, 96, (uint8_t *)IND_ZhiLeng, 2);
				}
				else
				{
					LCD_WriteEnglishString( 2, 96, (uint8_t *)"    ");
				}
				
				LCD_WriteEnglishString( 0, 96, (uint8_t *)"    ");
				LCD_WriteEnglishString( 4, 96, (uint8_t *)"    ");
				LCD_WriteEnglishString( 6, 96, (uint8_t *)"    ");
			}
			else
			{//处理阀值冲突的情况
				P_FAN=OFF;
				P_LAMP=OFF;
				LCD_WriteChineseString( 0, 96, (uint8_t *)ERR_FaZhi, 2);
				LCD_WriteChineseString( 2, 96, (uint8_t *)ERR_ChongTu, 2);
				LCD_WriteChineseString( 4, 96, (uint8_t *)ERR_TingZhi, 2);
				LCD_WriteChineseString( 6, 96, (uint8_t *)ERR_YunXing, 2);
			}
		}
		
		/*-----------空白部分结束线-----------*/
}

/*******************************************************************
*函数：void WorkStaSwitch(uint8_t *workSta, 
						uint8_t *workStaOld, keyType keyIn)
*功能：工作状态切换
*输入：uint8_t *workSta-当前工作状态,
*		uint8_t *workStaOld-上个回合的工作状态, 
*		keyType keyIn-当前按键键值
*输出：无
*特殊说明：无
*******************************************************************/
void WorkStaSwitch(uint8_t *workSta, uint8_t *workStaOld, 
											keyType keyIn)
{
	if(keyIn==s121)//功能键
	{
		*workSta = *workSta+1;
	}
	
	if(*workStaOld != *workSta)
	{
		if((*workStaOld==2)&&(*workSta == 3))
		{
			dataTransfer(RTC_BCD_Buf, RTC_Buf, DECIMAL_FORMAT, 7);
		}
		if((*workStaOld==8)&&(*workSta == 9))
		{
			dataTransfer(RTC_Buf, RTC_BCD_Buf, BCD_FORMAT, 7);
		}
		*workStaOld = *workSta;
	}

	if(*workSta>=9)
	{
		if(upTemp < downTemp)
		{//错误设置，需重新设置
			*workSta=1;
			F_Error = 1; //系统错误标记,上下限温度冲突
		}
		else if(Time_CheckValidity(RTC_BCD_Buf) != 1)// 备　　注: 返回值为0表示不合法, 为1表示合法
		{
			*workSta=3;
			F_Error = 2; //系统错误标记,时间格式不合规则
		}
		else
		{//正确设置，进入正常工作状态
			PCF8563_WirteTime(RTC_BCD_Buf);//写入新的时间
			printf("设置正确，进入正常工作状态,并写入新的RTC时间\r\n");
			LCD_Clr();
			*workSta=0;
		}
		
	}
	
	if(*workSta==1)//设置上限温度
	{ 
		if(keyIn==s106)//"上"键
		{
			if(upTemp<MAX_TEMP)
			{upTemp++;}
		}
		if(keyIn==s116)//"下"键
		{
			if(upTemp>MIN_TEMP)
			{upTemp--;}
		}
	}
	if(*workSta==2)//设置下限温度
	{
		if(keyIn==s106)//"上"键
		{
			if(downTemp<MAX_TEMP)
			{downTemp++;}
		}
		if(keyIn==s116)//"下"键
		{
			if(downTemp>MIN_TEMP)
			{downTemp--;}
		}
	}
	switch(*workSta)
	{
		case(0):
			break;
		case(1):
			break;
		case(2):
			break;
		case(3)://设置年份
				if(keyIn==s106)//"上"键
				{
					if(RTC_Buf[1]<99)
					{RTC_Buf[1]++;}
				}
				if(keyIn==s116)//"下"键
				{
					if(RTC_Buf[1]>0)
					{RTC_Buf[1]--;}
				}
			break;
		case(4)://设置月
				if(keyIn==s106)//"上"键
				{
					if(RTC_Buf[2]<12)
					{RTC_Buf[2]++;}
				}
				if(keyIn==s116)//"下"键
				{
					if(RTC_Buf[2]>1)
					{RTC_Buf[2]--;}
				}
			break;
		case(5)://设置日
				if(keyIn==s106)//"上"键
				{
					if(RTC_Buf[3]<31)
					{RTC_Buf[3]++;}
				}
				if(keyIn==s116)//"下"键
				{
					if(RTC_Buf[3]>1)
					{RTC_Buf[3]--;}
				}
			break;
		case(6)://设置时
				if(keyIn==s106)//"上"键
				{
					if(RTC_Buf[4]<23)
					{RTC_Buf[4]++;}
				}
				if(keyIn==s116)//"下"键
				{
					if(RTC_Buf[4]>0)
					{RTC_Buf[4]--;}
				}
			break;
		case(7)://设置分
				if(keyIn==s106)//"上"键
				{
					if(RTC_Buf[5]<59)
					{RTC_Buf[5]++;}
				}
				if(keyIn==s116)//"下"键
				{
					if(RTC_Buf[5]>0)
					{RTC_Buf[5]--;}
				}
			break;
		case(8)://设置秒
				if(keyIn==s106)//"上"键
				{
					if(RTC_Buf[6]<59)
					{RTC_Buf[6]++;}
				}
				if(keyIn==s116)//"下"键
				{
					if(RTC_Buf[6]>0)
					{RTC_Buf[6]--;}
				}
			break;
		default: break;
	}
}

/*******************************************************************
*函数：void KEY_HandleProcess(void)
*功能：按键事件处理进程
*输入：无
*输出：无
*特殊说明：无
*******************************************************************/
void KEY_HandleProcess(void)
{
	keyType keyValueTemp=noneKey;//按键键值寄存器
	
	keyValueTemp=KEY_ScanTriggerOnce();//按键扫描
	WorkStaSwitch(&work, &oldWork, keyValueTemp);
}

/*******************************************************************
*函数：void IR_HandleProcess(uint8_t irData)
*功能：红外遥控按键键值处理进程
*输入：uint8_t irData，红外键值
*输出：无
*特殊说明：无
*******************************************************************/
void IR_HandleProcess(uint8_t irData)
{
//遥控器第一行 CHANNEL
#define PWR_ON_OFF 162//用作开关机
#define MENU 226//用作设置键
//遥控器第二行
#define PREV 224//设置上限值
#define NEXT 144//设置下限值
#define PLAY_PAUSE 168//设置键
//遥控器第三行
#define VOL_ADD 2//加数值
#define VOL_SUB 152//减数值
#define E_QUIT 194//退出

