Stefancharles/AirconditionProject/source/app/stm32App.c
	switch(irData)
	{
		case(PWR_ON_OFF):
			systemPowerOnOff = !systemPowerOnOff;
			if(systemPowerOnOff != 1)
			{
				LCD_Clr();
				LCD12864_BL  = 1;    //关闭背光
				memset(buf_led,MAX_LEDCH,sizeof(buf_led));//设置数码管初始显示内容
				set_led_dispbuf(buf_led,0,8); //数码管显示初始化，置为全灭
				P_FAN = OFF;//控制风扇
				P_LAMP = OFF;//控制加热灯
				delay_ms(40);//等待数码管刷新完成
#ifdef USE_IWDG	
				IWDG_ReloadCounter();//重载看门狗定时器
#endif /*USE_IWDG*/
			}
			else
			{
				NVIC_SystemReset();//重启系统
			}
			break;
		case(PREV):
			work = 1;
			break;
		case(NEXT):
			work = 2;
			break;
		case(MENU):
		case(PLAY_PAUSE):
			work++;
			if(work>=3)
			{
				LCD_Clr();
				work = 0;
			}
			break;
		case(VOL_ADD):
			if(work == 1)
			{
				if(upTemp < MAX_TEMP)
				{upTemp++;}
			}
			else if(work == 2)
			{
				if(downTemp < MAX_TEMP)
				{downTemp++;}
			}
			break;
		case(VOL_SUB):
			if(work == 1)
			{
				if(upTemp > MIN_TEMP)
				{upTemp--;}
			}
			else if(work == 2)
			{
				if(downTemp > MIN_TEMP)
				{downTemp--;}
			}
			break;
		case(E_QUIT):
			LCD_Clr();
			work = 0;
			break;
		default:
			//work = 0;
			break;
	
	}
	
	if(work == 1)
	{
		if(upTemp<downTemp)
		{
			upTemp++;//downTemp--;
		}
	}
	else if(work == 2)
	{
		if(upTemp<downTemp)
		{
			downTemp--;//upTemp++;
		}
	}
}

/*******************************************************************
*函数：int8_t SE_SendSensor3(char *ApiTag0, uint32_t Value0, 
							char *ApiTag1, uint32_t Value1, 
							char *ApiTag2, uint32_t Value2,char *TimeStr)
*功能：发送传感数据到服务器
*输入：
	char *ApiTag0 实体对象标签名称
	uint32_t sensor0, 传感数值
	char *ApiTag1 实体对象标签名称
	uint32_t sensor1, 传感数值
	char *ApiTag2 实体对象标签名称
	uint32_t sensor2, 传感数值
	char *TimeStr，采集数据时的时间，须是yyyy-mm-dd hh:mm:ss格式
*输出：
		return = 0 ,sucess
		return < 0 ,error
*特殊说明：
*******************************************************************/
 int8_t SE_SendSensor3(char *ApiTag0, uint32_t Value0, 
						char *ApiTag1, uint32_t Value1, 
						char *ApiTag2, uint32_t Value2,char *TimeStr)
{
	uint8_t TryGo = 0;
	int8_t error = 0;
	uint8_t TrySend = 0;
	uint8_t TxetBuf[MAX_AT_TX_LEN];
	memset(TxetBuf,0x00,MAX_AT_TX_LEN);//清空缓存
	sprintf((char *)TxetBuf,"{\"t\":3,\"datatype\":2,\"datas\":{\"%s\":{\"%s\":%d},\"%s\":{\"%s\":%d},\"%s\":{\"%s\":%d}},\"msgid\":001}",
																ApiTag0,TimeStr,Value0,
																ApiTag1,TimeStr,Value1,
																ApiTag2,TimeStr,Value2);
se_send_sensor:
	if(ESP8266_IpSend((char *)TxetBuf, strlen((char *)TxetBuf)) < 0)
	{//发送失败
		error=-1;
	}
	else
	{//发送成功
		for(TryGo = 0; TryGo<50; TryGo++)//最多等待时间50*10=500ms
		{
			if(strstr((const char *)AT_RX_BUF, (const char *)"\"status\":0") == NULL)//检查响应状态是否为"上报成功"
			{
				error = -1;
			}
			else
			{
				error = 0;
				break;
			}
			delay_ms(10);
		}
	}
	if((error != 0)&&(TrySend<2))
	{
		printf("重发传感数据%d次\r\n",TrySend+1);
		TrySend++;
		goto se_send_sensor;
	}
	return error;
}

/*******************************************************************
*函数：int8_t SE_SendSensor2(char *ApiTag0, uint32_t Value0, 
							char *ApiTag1, uint32_t Value1,char *TimeStr)
*功能：发送传感数据到服务器
*输入：
	char *ApiTag0 实体对象标签名称
	uint32_t sensor0, 传感数值
	char *ApiTag1 实体对象标签名称
	uint32_t sensor1, 传感数值
	char *TimeStr，采集数据时的时间，须是yyyy-mm-dd hh:mm:ss格式
*输出：
		return = 0 ,sucess
		return < 0 ,error
*特殊说明：
*******************************************************************/
int8_t SE_SendSensor2(char *ApiTag0, uint32_t Value0, 
						char *ApiTag1, uint32_t Value1,char *TimeStr)
{
	uint8_t TryGo = 0;
	int8_t error = 0;
	uint8_t TrySend = 0;
	uint8_t TxetBuf[MAX_AT_TX_LEN];
	memset(TxetBuf,0x00,MAX_AT_TX_LEN);//清空缓存
	sprintf((char *)TxetBuf,"{\"t\":3,\"datatype\":2,\"datas\":{\"%s\":{\"%s\":%d},\"%s\":{\"%s\":%d}},\"msgid\":001}",
																ApiTag0,TimeStr,Value0,
																ApiTag1,TimeStr,Value1);
se_send_sensor:
	if(ESP8266_IpSend((char *)TxetBuf, strlen((char *)TxetBuf)) < 0)
	{//发送失败
		error=-1;
	}
	else
	{//发送成功
		for(TryGo = 0; TryGo<50; TryGo++)//最多等待时间50*10=500ms
		{
			if(strstr((const char *)AT_RX_BUF, (const char *)"\"status\":0") == NULL)//检查响应状态是否为"上报成功"
			{
				error = -1;
			}
			else
			{
				error = 0;
				break;
			}
			delay_ms(10);
		}
	}
	if((error != 0)&&(TrySend<2))
	{
		printf("重发传感数据%d次\r\n",TrySend+1);
		TrySend++;
		goto se_send_sensor;
	}
	return error;
}

/*******************************************************************
*函数：char *USER_GetJsonValue(char *cJson, char *Tag)
*功能：json为字符串序列，将json格式中的目标对象Tag对应的值字符串提取出来
*输入：
		char *cJson json字符串
		char *Tag 要操作的对象标签
*输出：返回数值的字符串形式的启始地址
*特殊说明：用户可以在此基础上改造和扩展该函数，这里只是个简单的DEMO
*******************************************************************/
char *USER_GetJsonValue(char *cJson, char *Tag)
{
	char *target = NULL;
	static char temp[10];
	int8_t i=0;
	
	memset(temp, 0x00, 128);
	sprintf(temp,"\"%s\":",Tag);
	target=strstr((const char *)cJson, (const char *)temp);
	if(target == NULL)
	{
		//printf("空字符！\r\n");
		return NULL;
	}
	i=strlen((const char *)temp);
	target=target+i;
	memset(temp, 0x00, 128);
	for(i=0; i<10; i++, target++)//数值超过10个位为非法，由于2^32=4294967296
	{
		if((*target<='9')&&(*target>='0'))
		{
			temp[i]=*target;
		}
		else
		{
			break;
		}
	}
	temp[i+1] = '\0';
	//printf("数值=%s\r\n",temp);
	return (char *)temp;
}

/*******************************************************************
*函数：char *USER_GetTempJsonValue(char *cJson, char *Tag)
*功能：json为字符串序列，将json格式中的目标对象Tag对应的值字符串转换为数值
*输入：
		char *cJson json字符串
		char *Tag 要操作的对象标签
*输出：返回数值
*特殊说明：用户可以在此基础上改造和扩展该函数，这里只是个简单的DEMO
*******************************************************************/
uint8_t USER_GetTempJsonValue(char *cJson, char *Tag)
{
	char *target = NULL;
	static char temp[10];
	uint8_t len=0;
	uint8_t value=0;
	int8_t i=0;
	
	memset(temp, 0x00, 128);
	sprintf(temp,"\"%s\":\"",Tag);
	target=strstr((const char *)cJson, (const char *)temp);
	if(target == NULL)
	{
		//printf("空字符！\r\n");
		return NULL;
	}
	i=strlen((const char *)temp);
	target=target+i;
	memset(temp, 0x00, 128);
	for(i=0; i<10; i++, target++)//数值超过10个位为非法，由于2^32=4294967296
	{
		if((*target<='9')&&(*target>='0'))
		{
			temp[i]=*target;
		}
		else
		{
			break;
		}
	}
	temp[i+1] = '\0';
	//printf("数值str=%s\r\n",temp);
	len=strlen((const char *)temp);
	switch(len)
	{
		case(1):value=temp[0]-'0';break;
		case(2):value=temp[1]-'0'+(temp[0]-'0')*10;break;
		case(3):value=temp[2]-'0'+(temp[0]-'0')*100+(temp[1]-'0')*10;break;
		default:break;
	}
	//printf("数值value=%d\r\n",value);
	return value;
}

/*******************************************************************
*函数：void USER_DataAnalysisProcess(char *RxBuf)
*功能：解析服务器数据
*输入：char *RxBuf 服务器下发数据
*输出：
*特殊说明：用户可以在此基础上改造和扩展该函数，这里只是个简单的DEMO
*******************************************************************/
void USER_DataAnalysisProcess(char *RxBuf)
{
	char *cmdid = NULL;
	uint8_t TxetBuf[128];
	uint8_t angle=0;//刻度
	if(strstr((const char *)RxBuf, (const char *)PING_REQ) != NULL)//心跳请求？
	{
		if(ESP8266_IpSend((char *)PING_RSP, strlen((const char *)PING_RSP)) < 0)//响应心跳
		{//发送失败
			printf("发送心跳包失败！\r\n");
		}
		else
		{
			printf("心跳包！\r\n");
		}
	}
	else if(strstr((const char *)RxBuf, (const char *)"\"t\":5") != NULL)//命令请求？
	{
		if(strstr((const char *)RxBuf, (const char *)"\"apitag\":\"powerCtrl\"") != NULL)//控制开关机
		{
			memset(TxetBuf,0x00,128);//清空缓存
			if((strstr((const char *)RxBuf, (const char *)"\"data\":1") != NULL))//开机
			{
				printf("开机！\r\n");
				;//...
				;//...
				cmdid = USER_GetJsonValue((char *)RxBuf, (char *)"cmdid");
				sprintf((char *)TxetBuf,"{\"t\":6,\"cmdid\":%s,\"status\":0,\"data\":1}",cmdid);
				//printf("%s\r\n",TxetBuf);////////////////////////////////////////////////////////////
				if(ESP8266_IpSend((char *)TxetBuf, strlen((char *)TxetBuf)) < 0)
				{//发送失败
					printf("发送响应失败！\r\n");
				}
				/*******************************************发送开关机信息**********************************************/
				sprintf(RTC_TimeTemp,"%d%d%d%d-%d%d-%d%d ",
							RTC_BCD_Buf[0]>>4,RTC_BCD_Buf[0]&0x0F,RTC_BCD_Buf[1]>>4,RTC_BCD_Buf[1]&0x0F,
							RTC_BCD_Buf[2]>>4,RTC_BCD_Buf[2]&0x0F,RTC_BCD_Buf[3]>>4,RTC_BCD_Buf[3]&0x0F);
				sprintf(&RTC_TimeTemp[11],"%d%d:%d%d:%d%d",
							RTC_BCD_Buf[4]>>4,RTC_BCD_Buf[4]&0x0F,RTC_BCD_Buf[5]>>4,RTC_BCD_Buf[5]&0x0F,
							RTC_BCD_Buf[6]>>4,RTC_BCD_Buf[6]&0x0F);
				if(SE_SendSensor2((char *)"alarm", alarm, 
							 (char *)"power", 1/*systemPowerOnOff*/,(char *)RTC_TimeTemp))
				{//发送失败
					printf("发送开/关机状态失败！\r\n");
				}
				/*******************************************开关机显示处理********************************************/
				if(systemPowerOnOff != 1)
				{//若之前的状态是关机，才执行下面的开关指令
					PowerOffDisplay(1);
				}
				systemPowerOnOff=1;
			}
			else if((strstr((const char *)RxBuf, (const char *)"\"data\":0") != NULL))//关机
			{
				printf("关机！\r\n");
				P_FAN = OFF;//控制风扇
				P_LAMP = OFF;//控制加热灯
				systemPowerOnOff=0;
				PowerOffDisplay(systemPowerOnOff);
				;//...
				;//...
				cmdid = USER_GetJsonValue((char *)RxBuf, (char *)"cmdid");
				sprintf((char *)TxetBuf,"{\"t\":6,\"cmdid\":%s,\"status\":0,\"data\":0}",cmdid);
				//printf("%s\r\n",TxetBuf);////////////////////////////////////////////////////////////
				if(ESP8266_IpSend((char *)TxetBuf, strlen((char *)TxetBuf)) < 0)
				{//发送失败
					printf("发送响应失败！\r\n");
				}
				/*******************************************发送开关机信息**********************************************/
				sprintf(RTC_TimeTemp,"%d%d%d%d-%d%d-%d%d ",
							RTC_BCD_Buf[0]>>4,RTC_BCD_Buf[0]&0x0F,RTC_BCD_Buf[1]>>4,RTC_BCD_Buf[1]&0x0F,
							RTC_BCD_Buf[2]>>4,RTC_BCD_Buf[2]&0x0F,RTC_BCD_Buf[3]>>4,RTC_BCD_Buf[3]&0x0F);
				sprintf(&RTC_TimeTemp[11],"%d%d:%d%d:%d%d",
							RTC_BCD_Buf[4]>>4,RTC_BCD_Buf[4]&0x0F,RTC_BCD_Buf[5]>>4,RTC_BCD_Buf[5]&0x0F,
							RTC_BCD_Buf[6]>>4,RTC_BCD_Buf[6]&0x0F);
				if(SE_SendSensor2((char *)"alarm", alarm, 
							 (char *)"power", systemPowerOnOff,(char *)RTC_TimeTemp))
				{//发送失败
					printf("发送开/关机状态失败！\r\n");
				}
			}
		}
#ifndef POTENTIOMETER	
		else if(strstr((const char *)RxBuf, (const char *)"\"apitag\":\"upperLimitCtrl\"") != NULL)//设置上限值
		{
			memset(TxetBuf,0x00,128);//清空缓存
			angle=USER_GetTempJsonValue((char *)RxBuf, (char *)"data");
			upTemp=angle;
			printf("设置上限值：%d！℃\r\n",angle);
		}
		else if(strstr((const char *)RxBuf, (const char *)"\"apitag\":\"lowerLimitCtrl\"") != NULL)//设置下限值
		{
			memset(TxetBuf,0x00,128);//清空缓存
			angle=USER_GetTempJsonValue((char *)RxBuf, (char *)"data");
			downTemp=angle;
			printf("设置下限值：%d！℃\r\n",angle);
		}
#endif /*POTENTIOMETER*/
	}
}

/*******************************************************************
*函数：void PowerOffDisplay(uint8_t power)
*功能：电源开关机显示界面处理
*输入：uint8_t power， 0是关机，1是开机
*输出：无
*特殊说明：无
*******************************************************************/
void PowerOffDisplay(uint8_t power)
{
	if(power != 1)
	{
		LCD_Clr();
		LCD12864_BL  = 1;    //关闭背光
		memset(buf_led,MAX_LEDCH,sizeof(buf_led));//设置数码管初始显示内容
		set_led_dispbuf(buf_led,0,8); //数码管显示初始化，置为全灭
		delay_ms(40);//等待数码管刷新完成
#ifdef USE_IWDG	
		IWDG_ReloadCounter();//重载看门狗定时器
#endif /*USE_IWDG*/
	}
	else
	{
		NVIC_SystemReset();//重启系统
	}
}

/*******************************************************************
*函数：void AlarmProcess(uint8_t alarm)
*功能：告警进程处理
*输入：uint8_t alarm，取值0或1,1的时候执行告警，0的时候不执行
*输出：无
*特殊说明：无
*******************************************************************/
void AlarmProcess(uint8_t alarm)
{
	if(alarm != 0)
	{
		if(P_LAMP_STA != ON)
		{
			if((uint16_t)(T_ALARM_MS - T_ALARM_MS_OLD) > (2000/3))//关灯2秒
			{
				T_ALARM_MS_OLD = (uint16_t)T_ALARM_MS;
				P_LAMP = ON;//开灯
				printf("温度失控警告！！\r\n");
			}
		}
		else
		{
			if((uint16_t)(T_ALARM_MS - T_ALARM_MS_OLD) > (1000/3))//开灯1秒
			{
				T_ALARM_MS_OLD = (uint16_t)T_ALARM_MS;
				P_LAMP = OFF;//关灯
				HalBuzzerBlink (HAL_BUZZER_0, 2, 50, 200);//蜂鸣器警告
				printf("温度失控警告！\r\n");
			}
		}
	}
	else
	{
		T_ALARM_MS_OLD = T_ALARM_MS = 0;
	}
}

